In [31]:
import pandas as pd

In [32]:
df = pd.read_csv("cats.csv")

In [48]:
df.columns

Index(['Breed', 'Age (Years)', 'Weight (kg)', 'Color', 'Gender', 'ID'], dtype='object')

In [69]:
df.head()

           Breed  Age (Years)  Weight (kg)          Color  Gender   ID
0   Egyptian Mau           12            7          White    Male  181
1  Scottish Fold           17            8  Tortoiseshell    Male  907
2         Sphynx            9            9         Orange    Male  732
3       Oriental            6            7           Gray  Female  464
4       Savannah           14            7  Tortoiseshell  Female  451

In [44]:
df.drop(['Unnamed: 0'], inplace=True, axis=1)

In [58]:
df[99:100]

          Breed  Age (Years)  Weight (kg)    Color  Gender   ID
99  Cornish Rex           11            6  Bicolor  Female  527

In [79]:
new_row = pd.DataFrame([{'Breed: Tabby', 'Age(Years): 3', 'Weight (kg): 5', 'Color: Orange', 'Gender: Male', 'ID: 998'}])

In [80]:
df = pd.concat([df, new_row], ignore_index=False)

In [81]:
df.head(1003)

,Breed,Age (Years),Weight (kg),Color,Gender,ID,0,1,2,3,4,5
0,Egyptian Mau,12.0,7.0,White,Male,181.0,NaN,NaN,NaN,NaN,NaN,NaN
1,Scottish Fold,17.0,8.0,Tortoiseshell,Male,907.0,NaN,NaN,NaN,NaN,NaN,NaN
2,Sphynx,9.0,9.0,Orange,Male,732.0,NaN,NaN,NaN,NaN,NaN,NaN
3,Oriental,6.0,7.0,Gray,Female,464.0,NaN,NaN,NaN,NaN,NaN,NaN
4,Savannah,14.0,7.0,Tortoiseshell,Female,451.0,NaN,NaN,NaN,NaN,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...
997,Persian,19.0,9.0,Cream,Male,659.0,NaN,NaN,NaN,NaN,NaN,NaN
998,Persian,17.0,3.0,Bicolor,Female,124.0,NaN,NaN,NaN,NaN,NaN,NaN
999,Manx,18.0,8.0,Black,Male,226.0,NaN,NaN,NaN,NaN,NaN,NaN
1000,NaN,NaN,NaN,NaN,NaN,NaN,Color: Orange,Weight (kg): 5,Gender: Male,Age(Years): 3,ID: 998,Bread: Tabby
0,NaN,NaN,NaN,NaN,NaN,NaN,Color: Orange,Weight (kg): 5,Gender: Male,Age(Years): 3,ID: 998,Breed: Tabby

In [84]:
df.drop(1000)

,Breed,Age (Years),Weight (kg),Color,Gender,ID,0,1,2,3,4,5
0,Egyptian Mau,12.0,7.0,White,Male,181.0,NaN,NaN,NaN,NaN,NaN,NaN
1,Scottish Fold,17.0,8.0,Tortoiseshell,Male,907.0,NaN,NaN,NaN,NaN,NaN,NaN
2,Sphynx,9.0,9.0,Orange,Male,732.0,NaN,NaN,NaN,NaN,NaN,NaN
3,Oriental,6.0,7.0,Gray,Female,464.0,NaN,NaN,NaN,NaN,NaN,NaN
4,Savannah,14.0,7.0,Tortoiseshell,Female,451.0,NaN,NaN,NaN,NaN,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...
996,Burmese,4.0,5.0,Pointed,Female,339.0,NaN,NaN,NaN,NaN,NaN,NaN
997,Persian,19.0,9.0,Cream,Male,659.0,NaN,NaN,NaN,NaN,NaN,NaN
998,Persian,17.0,3.0,Bicolor,Female,124.0,NaN,NaN,NaN,NaN,NaN,NaN
999,Manx,18.0,8.0,Black,Male,226.0,NaN,NaN,NaN,NaN,NaN,NaN
0,NaN,NaN,NaN,NaN,NaN,NaN,Color: Orange,Weight (kg): 5,Gender: Male,Age(Years): 3,ID: 998,Breed: Tabby

In [85]:
df.loc[98]

Breed          Maine Coon
Age (Years)           9.0
Weight (kg)           5.0
Color                Blue
Gender             Female
ID                  590.0
0                     NaN
1                     NaN
2                     NaN
3                     NaN
4                     NaN
5                     NaN
Name: 98, dtype: object

In [88]:
df.loc[0]["Color"]

0    White
0      NaN
Name: Color, dtype: object

In [92]:
df.loc[len(df)] = ["Tabby", 3, 5, "Orange", "Male", len(df), 0, 1, 2, 3, 4, 5]

In [104]:
df.drop([1000], inplace=True, axis=0)

In [101]:
df.head()

           Breed  Age (Years)  Weight (kg)          Color  Gender     ID
0   Egyptian Mau         12.0          7.0          White    Male  181.0
1  Scottish Fold         17.0          8.0  Tortoiseshell    Male  907.0
2         Sphynx          9.0          9.0         Orange    Male  732.0
3       Oriental          6.0          7.0           Gray  Female  464.0
4       Savannah         14.0          7.0  Tortoiseshell  Female  451.0

In [102]:
df['Weight (lbs.)'] = df['Weight (kg)'] * 2.205

In [105]:
df.tail()

,Breed,Age (Years),Weight (kg),Color,Gender,ID,Weight (lbs.)
997,Persian,19.0,9.0,Cream,Male,659.0,19.845
998,Persian,17.0,3.0,Bicolor,Female,124.0,6.615
999,Manx,18.0,8.0,Black,Male,226.0,17.640
0,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1002,Tabby,3.0,5.0,Orange,Male,1002.0,11.025

NameError: name 'df' is not defined